Enumeration for reason of warning.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  Since:  2016
 Syntax
  C#
public ConnectionWarning Reason { get; }
  Visual Basic
Public ReadOnly Property Reason As ConnectionWarning
	Get
  Visual C++
public:
property ConnectionWarning Reason {
	ConnectionWarning get ();
}
 See Also
  ConnectionValidationWarning Class
  Autodesk.Revit.DB Namespace